УправДом/src/Documents/УстановкаТарифовКомунальныхУслуг/УстановкаТарифовКомунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаТарифовКомунальныхУслуг</name>
  <registerRecords>InformationRegister.ТарифыКоммунальныхУслуг</registerRecords>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТарифов</name>
    <attributes>
      <name>ВидПлатежа</name>
      <type>
        <types>CatalogRef.ВидыПлатежей</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправДом/src/InformationRegisters/ТарифыКоммунальныхУслуг/ТарифыКоммунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыКоммунальныхУслуг</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/Documents/УстановкаТарифовКомунальныхУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// Проверка, проведен ли текущий документ, для запрета перепрведения	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТарифыКоммунальныхУслуг.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ТарифыКоммунальныхУслуг КАК ТарифыКоммунальныхУслуг
		|ГДЕ
		|	ТарифыКоммунальныхУслуг.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = 
		"Повторное проведение документа запрещено. Для изменения необходимо сначала отменить проведение.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	
	// регистр ТарифыКоммунальныхУслуг
	Движения.ТарифыКоммунальныхУслуг.Записывать = Истина;
	Для Каждого Строка Из СписокТарифов Цикл
		Движение = Движения.ТарифыКоммунальныхУслуг.Добавить();
		Движение.Период = ДатаНачалаДействия;
		Движение.ВидПлатежа = Строка.ВидПлатежа;
		Движение.Тариф = Строка.Тариф;
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

#КонецЕсли
